MiesSuomesta/STCP/LTE/stcp+mqtt-for-nRF9151-zephyr/moduuli-tcp/src/low_level_pointer.c
#include <zephyr/kernel.h>
#include <zephyr/random/random.h>
#include <zephyr/net/socket.h>
#include <zephyr/logging/log.h>
#include <zephyr/init.h>
#include <zephyr/sys/heap_listener.h>
#include <zephyr/sys/sys_heap.h>
#include <zephyr/net/net_ip.h>
#include <zephyr/sys/atomic.h>

#include <modem/lte_lc.h>
#include <modem/nrf_modem_lib.h>

#include <errno.h>
#include <string.h>
#include <stdlib.h>


#include <stcp_api.h>
#include <stcp/stcp_struct.h>
#include <stcp/stcp_net.h>
#include <stcp/workers.h>
#include <stcp/utils.h>
#include <stcp/stcp_mqtt.h>
#include <stcp/utils.h>
#include <stcp/stcp_operations_zephyr.h>
#include <stcp/low_level_pointer.h>

#if STCP_POINTER_TRACKING
static int g_stcp_pointers_alive = 0;
static struct stcp_pointer_item the_bookeeping_list[STCP_POINTER_TRACKING_LIST_SIZE] = { 0 };

struct stcp_pointer_item * stcp_pointer_list_get_slot_ptr(int slot) {
    if (slot >= STCP_POINTER_TRACKING_LIST_SIZE) return NULL;
    if (slot < 0) return NULL;
    return &(the_bookeeping_list[slot]);
}

extern char * stcp_debug_find_symbol_name(uint32_t *pFrom);

int stcp_pointer_list_get_free_slot() {
    int i = 0;
    int freeSlot = 0;
    struct stcp_pointer_item *pItem = the_bookeeping_list;

    while (i < STCP_POINTER_TRACKING_LIST_SIZE) {
        pItem = stcp_pointer_list_get_slot_ptr(i);
        if (pItem == NULL) {
            continue;
        }

        if (pItem->alive == 0) {
            LDBG("Found dead at %d", i);
            return i;
        }

        if (pItem->alive == 2) {

            LDBG("Found ghost at %d", i);
            // Clenaup
            stcp_debug_info_free(pItem->alloc_dip);
            pItem->alloc_dip = NULL;

            stcp_debug_info_free(pItem->dealloc_dip);
            pItem->dealloc_dip = NULL;

            pItem->alive        = 0;
            pItem->bytes        = 0;
            pItem->ptr          = NULL;
            pItem->first_lr     = NULL;
            pItem->lr           = NULL;

            return i;
        }

        i++;
    }

    return -1;
}

int stcp_pointer_list_get_slot_with_pointer(void* pPtr) {
    int i = 0;
    struct stcp_pointer_item *pItem = the_bookeeping_list;
    LDBG("Searching for %p ...", pPtr);
    while (i < STCP_POINTER_TRACKING_LIST_SIZE) {
        pItem = stcp_pointer_list_get_slot_ptr(i);
        if (pItem == NULL) {
            continue;
        }

        if (pItem->ptr == pPtr) {
            LDBG("Got slot %d for %p ...", i, pPtr);
            return i;
        }
        i++;
    }

    return -1;
}

int stcp_pointer_list_use_slot(int slot, void* pPtr, size_t bytes, void *lr, int rust) {
    struct stcp_pointer_item *pItem = NULL;

    pItem = stcp_pointer_list_get_slot_ptr(slot);
    if (pItem == NULL) {
        return -EINVAL;
    }

    if (pItem->alive != 1) {
        pItem->first_lr     = lr;
        pItem->bytes        = bytes;
        pItem->ptr          = pPtr;
        pItem->from_rust    = rust;
        pItem->alloc_dip    = stcp_debug_info_snapshot();
    }

    pItem->alive    = 1;
    pItem->lr       = lr;

    LDBG("SLOT[%d] set alive { ptr:%p, lr (%p) } From rust: %d", 
            slot, 
            pPtr,
            stcp_debug_find_symbol_name(lr),
            lr,
            rust);
    return 1;
}

int stcp_pointer_list_free_slot(int slot, void *freeLR) {
    struct stcp_pointer_item *pItem = NULL;

    pItem = stcp_pointer_list_get_slot_ptr(slot);
    if (pItem == NULL) {
        return -EINVAL;
    }

    if (pItem->alive != 1) {
        LDBGBIG("Slot %d not alive..", slot);
        return -ENXIO;
    }

    pItem->lr = freeLR;
    pItem->alive = 2; // May be freed
    pItem->dealloc_dip  = stcp_debug_info_snapshot();
    int allocItems      = stcp_debug_info_count_list_items(pItem->alloc_dip,   pItem->alloc_dip->backtrace);
    int deallocItems    = stcp_debug_info_count_list_items(pItem->dealloc_dip, pItem->dealloc_dip->backtrace);

    LDBGBIG("Allocation of %d bytes, Allocated at %s (%p), Deallocated at %s (%p)", 
            pItem->bytes,
            stcp_debug_find_symbol_name(pItem->first_lr),
            pItem->first_lr,
            stcp_debug_find_symbol_name(freeLR),
            freeLR);

    if (allocItems > 0) {
        LDBG("Allocation trace: ");
        stcp_debug_info_dump(pItem->alloc_dip);
    }
    
    if (deallocItems > 0) {
        LDBG("Deallocation trace: ");
        stcp_debug_info_dump(pItem->dealloc_dip);
    }

    // MUST FREE THIS!
    k_free(pItem->ptr);

    LDBG("SLOT[%d] Freed", slot);
    return 1;
}

void stcp_pointer_dump_status() {
    int i = 0;
    struct stcp_pointer_item *pItem = NULL;

    while (i < STCP_POINTER_TRACKING_LIST_SIZE) {
        pItem = stcp_pointer_list_get_slot_ptr(i);
        if (pItem == NULL) {
            continue;
        }

        if (pItem->alive > 0) {
            
            if (pItem->alive > 1) {
                LDBGBIG("Allocation of %d bytes @ address %p, Allocated at %s (%p), Deallocated at %s (%p)", 
                        pItem->bytes, 
                        pItem->ptr, 
                        stcp_debug_find_symbol_name(pItem->first_lr),
                        pItem->first_lr,
                        stcp_debug_find_symbol_name(pItem->lr),
                        pItem->lr
                    );
            } else {
                LDBGBIG("Allocation of %d bytes @ address %p, Allocated at %s (%p), Deallocated: not yet..", 
                        pItem->bytes, 
                        pItem->ptr, 
                        stcp_debug_find_symbol_name(pItem->first_lr),
                        pItem->first_lr
                    );
            }
            
            LDBG("Allocation trace: ");
            stcp_debug_info_dump(pItem->alloc_dip);
            
            if (pItem->alive > 1) {
                LDBG("Deallocation trace: ");
                stcp_debug_info_dump(pItem->dealloc_dip);
            }
            
        }
        i++;
    }
}

void stcp_pointer_dump_allocs_in_brief() {
    int i = 0;
    struct stcp_pointer_item *pItem = NULL;
    LDBGBIG("Memory allocations alive, in brief:");
    while (i < STCP_POINTER_TRACKING_LIST_SIZE) {
        pItem = stcp_pointer_list_get_slot_ptr(i);
        if (pItem == NULL) {
            return;
        }

        if (pItem->alive > 0) {
            if (pItem->alive > 1) {
                LDBG("Allocation of %d bytes, Allocated at %s (%p), Deallocated at %s (%p)", 
                        pItem->bytes, 
                        stcp_debug_find_symbol_name(pItem->first_lr),
                        pItem->first_lr, 
                        stcp_debug_find_symbol_name(pItem->lr),
                        pItem->lr);
            } else {
                LDBG("Allocation of %d bytes, Allocated at %s (%p), Deallocated: not yet..", 
                        pItem->bytes, 
                        stcp_debug_find_symbol_name(pItem->first_lr),
                        pItem->first_lr
                    );
            }
        }
        i++;
    }
}

int stcp_track_pointer(void *pPtr, void *lr, size_t size, int rust) {
        
    if (pPtr == NULL) {
        return -EINVAL;
    }

    int idx = stcp_pointer_list_get_free_slot();

    if (idx < 0) {
        stcp_pointer_dump_allocs_in_brief();
        stcp_pointer_dump_status();
        return -ENOBUFS;
    }

    g_stcp_pointers_alive++;
    stcp_pointer_list_use_slot(idx, pPtr, size, lr, rust);
    stcp_pointer_dump_allocs_in_brief();
    return idx;
}

int stcp_untrack_pointer(void* pPtr, void* freelr) {

    if (pPtr == NULL) {
        return;
    }

    int idx = stcp_pointer_list_get_slot_with_pointer(pPtr);
    
    if (idx < 0) {
        LERR("pPtr NOT RECORDED");
        stcp_pointer_dump_allocs_in_brief();
        stcp_pointer_dump_status();
        stcp_dump_bt();
        LDBG("pPtr %p freed off record!", pPtr);
        k_stcp_free(pPtr);
    } else {
        // Tämä hoitaa muistin vapautuksen slotista
        stcp_pointer_list_free_slot(idx, freelr);
    }

    g_stcp_pointers_alive--;
    if (g_stcp_pointers_alive < 0) {
        LERR("Unbalanced pointer operations!");
        stcp_pointer_dump_allocs_in_brief();
        stcp_pointer_dump_status();
        stcp_dump_bt();
    }

    return idx;
}

void *stcp_low_level_mem_alloc(size_t n, int rust) {
    void *lr =  __builtin_return_address(0);
    LDBGBIG("Allocating %d bytes from %p (Rust? %d)", n, lr, rust);
    void *p  = k_malloc(n); // Plain kutsu tässä
    int slot = stcp_track_pointer(p, lr, n, rust);
    LDBGBIG("Allocated %d slot for pointer %p", slot, p);
    return p;
}

void stcp_low_level_mem_dealloc(void *p, int rust) {
    void *lr =  __builtin_return_address(0);
    int slot = stcp_untrack_pointer(p, lr);
    if (slot >= 0) {
        LDBGBIG("Deallocated %d slot for pointer %p", slot, p);
    } else {
        LERRBIG("Not tracked pointer %p", p);
    }
}

#endif
